In [5]:
a=2
print(a)

2

In [12]:
a=12
b=2.35666665674764
c=True
d="Akash"
print(type(d))
print(type(b))

<class 'str'>
<class 'float'>

In [2]:
a=[1,2,3,4,5,6]
print(a[2])

3

In [13]:
# to check the all keyword
import keyword
print( keyword.kwlist)

['False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']

In [19]:
age=int(input("enter the age"))

if age<3:
    print(" kid")
elif age>=3:
    print("adult")
else:
    print("aged")

enter the age 23

adult

In [18]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [94]:
a=[10,20,20,30,30,40,50,60]
# print(a[2])
# a[0]=400
# a.append(23)
# a.remove(3)
# a.pop(1)
# a.pop()
dup=[]
for i in a:
    
    if a.count(i)>1 and i not in dup:
        dup.append(i)
print(dup)

[20, 30]

In [16]:
def n
for i in a:
    if i%2!=0:
        print(i)

1
3
5

In [30]:
a={
    "Id" :(1,2,3),
    "Name":("Akash","Abhi","aditya")
        



}
print(a)

{'Id': (1, 2, 3), 'Name': ('Akash', 'Abhi', 'aditya')}

In [43]:
a="akash"

print(a)

akash

In [79]:
# import os
# os.listdir()
# os.getcwd() 
# for current dir
# os.mkdir()
# os.rmdir("customer.csv")

In [1]:
file = open("akash.txt","w")
file.write("this is file handling")

file.close()

In [11]:
# copy :In copy we create as ne =w object instead of sharing memory.

In [19]:
# import copy 
a=[[1,3],[3,4]]

[19]

In [42]:
# import copy
original=[[1,2],3]
copy_list=copy.deepcopy(original)
copy_list[1]="akash"
copy_list.append("new")
copy_list[0][1]=40
print("Original:",original)
print(" Copy list:",copy_list)

Original: [[1, 2], 3]
 Copy list: [[1, 40], 'akash', 'new']

In [37]:
# deep copy
original=[[1,2],3]
copy_list=copy.deepcopy(original)
copy_list[1]="akash"
copy_list.append("new")
copy_list[0][1]=40
print("Original:",original)
print(" Copy list:",copy_list)

Original: [[1, 2], 3]
 Copy list: [[1, 40], 'akash', 'new']

In [5]:
# ==========NUMPY======
import numpy as np
a=np.array([[[1,2,3,4]]])
a.ndim

3

In [7]:
print(np.__version__)

2.3.5

In [8]:
A=np.array([1,2,3,4])
print(A)

[1 2 3 4]

In [66]:
import numpy as np
# np.ones(5)
# print(np.zeros(3))
# print(np.arange(1,6,2))
a=np.array([[[[[1,2,3,1],[4,5,6,5]]]]])
print(a.shape)
print(a.size)
print(a.ndim)
print(a.dtype)
# print(a.transpose())
print(a.nbytes)

(1, 1, 1, 2, 4)
8
5
int64
64

In [27]:
# CONCATE
import numpy as np
# a=np.array([1,2,3,4])
# b=np.array([5,6,7,8])
# c=np.array([10,20,30,40])
# print(np.concatenate((a,b,c)))
# print(np.vstack((a,b,c)))
# print(np.hstack((a,b,c)))

# It divided into equal part
# print(np.split(a,2))


# SEARCHING
arr=np.array([ 10, 2200,3 , 4 , 5 , 6 , 7 ])
# np.where(arr==5)

# np.sort(arr)
np.argsort(arr)

array([2, 3, 4, 5, 6, 0, 1])

In [49]:
# filter
arr=np.array([ 10, 2200,3 , 4 , 5 , 6 , 7 ])
print(arr[(arr>1) & (arr<100)])
print(arr+1)

[10  3  4  5  6  7]
[  11 2201    4    5    6    7    8]

In [134]:
# --------------------PANDAS -----------------#
import pandas as pd
a=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

# S=pd.DataFrame(a)
# S.columns=["col1"]
# S
a.iloc[a]
a.loc["a"]

np.int64(1)

In [107]:
data={
    "Name":["a","b","c"],
    "Age":[1,2,3],
    "id":[101,102,103]
}
df=pd.DataFrame(data)
df

# print(df.dtypes)
# df.columns
df.shape
# df.info()

(3, 3)

In [113]:
df[["id","Name"]]

    id Name
0  101    a
1  102    b
2  103    c

In [114]:
# FINDING THE THROUGH INDEX
df.iloc[1]

Name      b
Age       2
id      102
Name: 1, dtype: object

In [118]:
df.iloc[1]

Name      b
Age       2
id      102
Name: 1, dtype: object

In [135]:
df.loc[1]

Name      b
Age       2
id      102
Name: 1, dtype: object

data={
    "Name":["a","b","c"],
    "Age":[21,40,3],
    "marks":[80,40,90]
}
df=pd.DataFrame(data)
df

In [147]:
data={
    "Name":["a","b","c"],
    "Age":[21,14,30],
    "marks":[101,102,103]
}
df=pd.DataFrame(data)
df

  Name  Age  marks
0    a   21    101
1    b   14    102
2    c   30    103

In [148]:
df[
    (df["Age"]>18) & (df["marks"]>90)
    ]

  Name  Age  marks
0    a   21    101
2    c   30    103

In [151]:
df=pd.read_excel("raw data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [159]:
df["Salary"].sum()
df["Department"].value_counts()

Department
Sales        5
Marketing    5
Finance      5
IT           5
Name: count, dtype: int64

In [174]:
# df["Full Name"]=df["Name"]+" "+df["Lastname"]
df.rename(columns={"Lastname":"Last Name"},inplace=True)
df

    Id First Name Last Name  Salary Department  Mobile no.       Full Name
0    1      Anshu    Rajput   90000      Sales  8595787610    Anshu Rajput
1    2     Manish     Kumar   62000  Marketing  8595787611    Manish Kumar
2    3      Aadil      Khan   70000    Finance  8595787612      Aadil Khan
3    4    Chandan    Thakur   80000         IT  8595787613  Chandan Thakur
4    5       Aman     Anand   20000      Sales  8595787614      Aman Anand
5    6      Badal     Singh   65000  Marketing  8595787615     Badal Singh
6    7       Anil     Yadav   55000    Finance  8595787616      Anil Yadav
7    8      Akash     Verma   75000         IT  8595787617     Akash Verma
8    9       Yash  Kushwaha   25000      Sales  8595787618   Yash Kushwaha
9   10   Abhishek     Yadav   95000  Marketing  8595787619  Abhishek Yadav
10  11    Aaditya     Yadav   10000    Finance  8595787620   Aaditya Yadav
11  12      Daksh   Chauhan   66000         IT  8595787621   Daksh Chauhan
12  13      Ayush     Singh   30000      Sales  8595787622     Ayush Singh
13  14       Arun     Singh   89000  Marketing  8595787623      Arun Singh
14  15     Ashish     Rawat   90000    Finance  8595787624    Ashish Rawat
15  16     Shivam    Thakur   91000         IT  8595787625   Shivam Thakur
16  17      Swati    Thakur   92000      Sales  8595787626    Swati Thakur
17  18     Vineet      Ojha   93000  Marketing  8595787627     Vineet Ojha
18  19     Sourav    Mathur   94000    Finance  8595787628   Sourav Mathur
19  20     Yogesh    Sharma   95000         IT  8595787629   Yogesh Sharma

In [177]:
df.to_excel("raw data .xlsx", index=False)
df

    Id First Name Last Name  Salary Department  Mobile no.       Full Name
0    1      Anshu    Rajput   90000      Sales  8595787610    Anshu Rajput
1    2     Manish     Kumar   62000  Marketing  8595787611    Manish Kumar
2    3      Aadil      Khan   70000    Finance  8595787612      Aadil Khan
3    4    Chandan    Thakur   80000         IT  8595787613  Chandan Thakur
4    5       Aman     Anand   20000      Sales  8595787614      Aman Anand
5    6      Badal     Singh   65000  Marketing  8595787615     Badal Singh
6    7       Anil     Yadav   55000    Finance  8595787616      Anil Yadav
7    8      Akash     Verma   75000         IT  8595787617     Akash Verma
8    9       Yash  Kushwaha   25000      Sales  8595787618   Yash Kushwaha
9   10   Abhishek     Yadav   95000  Marketing  8595787619  Abhishek Yadav
10  11    Aaditya     Yadav   10000    Finance  8595787620   Aaditya Yadav
11  12      Daksh   Chauhan   66000         IT  8595787621   Daksh Chauhan
12  13      Ayush     Singh   30000      Sales  8595787622     Ayush Singh
13  14       Arun     Singh   89000  Marketing  8595787623      Arun Singh
14  15     Ashish     Rawat   90000    Finance  8595787624    Ashish Rawat
15  16     Shivam    Thakur   91000         IT  8595787625   Shivam Thakur
16  17      Swati    Thakur   92000      Sales  8595787626    Swati Thakur
17  18     Vineet      Ojha   93000  Marketing  8595787627     Vineet Ojha
18  19     Sourav    Mathur   94000    Finance  8595787628   Sourav Mathur
19  20     Yogesh    Sharma   95000         IT  8595787629   Yogesh Sharma

In [178]:
df=pd.read_excel("raw data .xlsx")
df

    Id First Name Last Name  Salary Department  Mobile no.       Full Name
0    1      Anshu    Rajput   90000      Sales  8595787610    Anshu Rajput
1    2     Manish     Kumar   62000  Marketing  8595787611    Manish Kumar
2    3      Aadil      Khan   70000    Finance  8595787612      Aadil Khan
3    4    Chandan    Thakur   80000         IT  8595787613  Chandan Thakur
4    5       Aman     Anand   20000      Sales  8595787614      Aman Anand
5    6      Badal     Singh   65000  Marketing  8595787615     Badal Singh
6    7       Anil     Yadav   55000    Finance  8595787616      Anil Yadav
7    8      Akash     Verma   75000         IT  8595787617     Akash Verma
8    9       Yash  Kushwaha   25000      Sales  8595787618   Yash Kushwaha
9   10   Abhishek     Yadav   95000  Marketing  8595787619  Abhishek Yadav
10  11    Aaditya     Yadav   10000    Finance  8595787620   Aaditya Yadav
11  12      Daksh   Chauhan   66000         IT  8595787621   Daksh Chauhan
12  13      Ayush     Singh   30000      Sales  8595787622     Ayush Singh
13  14       Arun     Singh   89000  Marketing  8595787623      Arun Singh
14  15     Ashish     Rawat   90000    Finance  8595787624    Ashish Rawat
15  16     Shivam    Thakur   91000         IT  8595787625   Shivam Thakur
16  17      Swati    Thakur   92000      Sales  8595787626    Swati Thakur
17  18     Vineet      Ojha   93000  Marketing  8595787627     Vineet Ojha
18  19     Sourav    Mathur   94000    Finance  8595787628   Sourav Mathur
19  20     Yogesh    Sharma   95000         IT  8595787629   Yogesh Sharma

In [4]:
import pandas as pd
df=pd.read_csv(r"https://gist.githubusercontent.com/fishtai0/c243e57e3d80358b3d081406870c89a8/raw/company-sales.csv")
df

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600
5,6,2760,1555,4890,7490,1890,1555,20140,201400
6,7,2980,1120,4780,8980,1780,1120,29550,295500
7,8,3700,1400,5860,9960,2860,1400,36140,361400
8,9,3540,1780,6100,8100,2100,1780,23400,234000
9,10,1990,1890,8300,10300,2300,1890,26670,266700
10,11,2340,2100,7300,13300,2400,2100,41280,412800
11,12,2900,1760,7400,14400,1800,1760,30020,300200

In [7]:
df.describe()

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
count,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.00000,12.000000
mean,6.500000,2873.333333,1542.916667,5825.833333,9500.833333,2117.500000,1542.916667,26027.50000,260275.000000
std,3.605551,584.595172,316.733745,1242.032486,2348.095779,617.724931,316.733745,7014.36594,70143.659404
min,1.000000,1990.000000,1120.000000,4550.000000,6100.000000,1200.000000,1120.000000,18330.00000,183300.000000
25%,3.750000,2460.000000,1305.000000,4862.500000,8015.000000,1795.000000,1305.000000,21065.00000,210650.000000
50%,6.500000,2830.000000,1527.500000,5530.000000,9090.000000,1995.000000,1527.500000,22935.00000,229350.000000
75%,9.250000,3435.000000,1765.000000,6400.000000,10045.000000,2325.000000,1765.000000,29667.50000,296675.000000
max,12.000000,3700.000000,2100.000000,8300.000000,14400.000000,3550.000000,2100.000000,41280.00000,412800.000000

In [11]:
df.columns=df.columns.str.title()
df

,Month_Number,Facecream,Facewash,Toothpaste,Bathingsoap,Shampoo,Moisturizer,Total_Units,Total_Profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600
5,6,2760,1555,4890,7490,1890,1555,20140,201400
6,7,2980,1120,4780,8980,1780,1120,29550,295500
7,8,3700,1400,5860,9960,2860,1400,36140,361400
8,9,3540,1780,6100,8100,2100,1780,23400,234000
9,10,1990,1890,8300,10300,2300,1890,26670,266700
10,11,2340,2100,7300,13300,2400,2100,41280,412800
11,12,2900,1760,7400,14400,1800,1760,30020,300200

In [13]:
df.isnull().sum()

Month_Number    0
Facecream       0
Facewash        0
Toothpaste      0
Bathingsoap     0
Shampoo         0
Moisturizer     0
Total_Units     0
Total_Profit    0
dtype: int64

In [27]:
df.head()
df.tail()
df.info()
df.shape
print("Show the all columns :",df.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Month_Number  12 non-null     int64
 1   Facecream     12 non-null     int64
 2   Facewash      12 non-null     int64
 3   Toothpaste    12 non-null     int64
 4   Bathingsoap   12 non-null     int64
 5   Shampoo       12 non-null     int64
 6   Moisturizer   12 non-null     int64
 7   Total_Units   12 non-null     int64
 8   Total_Profit  12 non-null     int64
dtypes: int64(9)
memory usage: 996.0 bytes
Show the all columns : Index(['Month_Number', 'Facecream', 'Facewash', 'Toothpaste', 'Bathingsoap',
       'Shampoo', 'Moisturizer', 'Total_Units', 'Total_Profit'],
      dtype='object')

In [19]:
df.to_csv("C_data.csv", index=False)
df

,Month_Number,Facecream,Facewash,Toothpaste,Bathingsoap,Shampoo,Moisturizer,Total_Units,Total_Profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600
5,6,2760,1555,4890,7490,1890,1555,20140,201400
6,7,2980,1120,4780,8980,1780,1120,29550,295500
7,8,3700,1400,5860,9960,2860,1400,36140,361400
8,9,3540,1780,6100,8100,2100,1780,23400,234000
9,10,1990,1890,8300,10300,2300,1890,26670,266700
10,11,2340,2100,7300,13300,2400,2100,41280,412800
11,12,2900,1760,7400,14400,1800,1760,30020,300200

In [ ]:
# Cleaning

In [34]:
df=df.drop_duplicates()
df

,Month_Number,Facecream,Facewash,Toothpaste,Bathingsoap,Shampoo,Moisturizer,Total_Units,Total_Profit
0,1,NaN,1500,5200,9200,1200,1500,21100,211000
1,2,2630.0,1200,5100,6100,2100,1200,18330,183300
2,3,2140.0,1340,4550,9550,3550,1340,22470,224700
3,4,3400.0,1130,5870,8870,1870,1130,22270,222700
4,5,3600.0,1740,4560,7760,1560,1740,20960,209600
5,6,2760.0,1555,4890,7490,1890,1555,20140,201400
6,7,2980.0,1120,4780,8980,1780,1120,29550,295500
7,8,3700.0,1400,5860,9960,2860,1400,36140,361400
8,9,3540.0,1780,6100,8100,2100,1780,23400,234000
9,10,1990.0,1890,8300,10300,2300,1890,26670,266700
10,11,2340.0,2100,7300,13300,2400,2100,41280,412800
11,12,2900.0,1760,7400,14400,1800,1760,30020,300200

In [35]:
df.iloc[0, 1] = 2500
df

,Month_Number,Facecream,Facewash,Toothpaste,Bathingsoap,Shampoo,Moisturizer,Total_Units,Total_Profit
0,1,2500.0,1500,5200,9200,1200,1500,21100,211000
1,2,2630.0,1200,5100,6100,2100,1200,18330,183300
2,3,2140.0,1340,4550,9550,3550,1340,22470,224700
3,4,3400.0,1130,5870,8870,1870,1130,22270,222700
4,5,3600.0,1740,4560,7760,1560,1740,20960,209600
5,6,2760.0,1555,4890,7490,1890,1555,20140,201400
6,7,2980.0,1120,4780,8980,1780,1120,29550,295500
7,8,3700.0,1400,5860,9960,2860,1400,36140,361400
8,9,3540.0,1780,6100,8100,2100,1780,23400,234000
9,10,1990.0,1890,8300,10300,2300,1890,26670,266700
10,11,2340.0,2100,7300,13300,2400,2100,41280,412800
11,12,2900.0,1760,7400,14400,1800,1760,30020,300200

In [39]:
#Ensure numeric column have a correct datatype
numeric_col= ['Month_Number', 'Facecream', 'Facewash', 'Toothpaste', 'Bathingsoap',
       'Shampoo', 'Moisturizer', 'Total_Units', 'Total_Profit']
for col in numeric_col:
    df[col]=pd.to_numeric(df[col],errors='coerce')
df

,Month_Number,Facecream,Facewash,Toothpaste,Bathingsoap,Shampoo,Moisturizer,Total_Units,Total_Profit
0,1,2500.0,1500,5200,9200,1200,1500,21100,211000
1,2,2630.0,1200,5100,6100,2100,1200,18330,183300
2,3,2140.0,1340,4550,9550,3550,1340,22470,224700
3,4,3400.0,1130,5870,8870,1870,1130,22270,222700
4,5,3600.0,1740,4560,7760,1560,1740,20960,209600
5,6,2760.0,1555,4890,7490,1890,1555,20140,201400
6,7,2980.0,1120,4780,8980,1780,1120,29550,295500
7,8,3700.0,1400,5860,9960,2860,1400,36140,361400
8,9,3540.0,1780,6100,8100,2100,1780,23400,234000
9,10,1990.0,1890,8300,10300,2300,1890,26670,266700
10,11,2340.0,2100,7300,13300,2400,2100,41280,412800
11,12,2900.0,1760,7400,14400,1800,1760,30020,300200

In [43]:
#Filling any numeric value with median
for col in numeric_col:
    df[col].fillna(df[col].median(),inplace=True)
    df

C:\Users\brije\AppData\Local\Temp\ipykernel_1660\1096963595.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].median(),inplace=True)

In [44]:
df["Avg_price_per_unit"]= df["Total_Profit"]/df["Total_Units"]